#include<stdio.h>
#include <math.h>
int main(){
	const int sp=32; /*оголошуємо цілочисельну константу sp*/
	unsigned int a; /*оголошуємо цілочисельну змінну а */
	printf("Enter digit:"); //виводимо на екран "Enter digit:"
	scanf("%i",&a); //зчитуємо з клавітури а
	printf("*************\n"); //виводимо на екран "*************"
	printf("%d%d%d%d%d\n",a,a,a,a,a ); //виводимо цілочисельне значення а 5 разів
	printf("%c%d%c%d%c\n",sp, a, sp, a, sp); //виводимо цілочисельні змінну а, 2 рази, і константу sp, 3 рази
	printf("%c%d%d%c%c\n",sp, sp , a, sp, sp ); //виодимо цілочисельні змінну а, 1 раз, і константу sp, 4 рази
	printf("%c%d%c%d%c\n",sp, a, sp, a, sp); //виводимо цілочисельні змінну а, 2 рази, і константу sp, 3 рази
	printf("%d%d%d%d%d\n",a,a,a,a,a); //виводимо цілочисельне значення а 5 разів
	printf("*************\n"); //виводимо на екран "*************"
	return 0; // у разі коректної роботи функції, вона повернк значення 0
}
